{
  "backend": "tokenizers",
  "bos_token": "[CLS]",
  "cls_token": "[CLS]",
  "do_lower_case": false,
  "eos_token": "[SEP]",
  "is_local": false,
  "keep_accents": false,
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "remove_space": true,
  "sep_token": "[SEP]",
  "sp_model_kwargs": {},
  "tokenizer_class": "XLNetTokenizer",
  "unk_id": 0,
  "unk_token": "[UNK]"
}
